Bunkering_06/0.orig/O2
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2406                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0.23;

boundaryField
{
    right               { type inletOutlet; inletValue $internalField; value $internalField; }
    left                { type inletOutlet; inletValue $internalField; value $internalField; }
    front               { type inletOutlet; inletValue $internalField; value $internalField; }
    back                { type inletOutlet; inletValue $internalField; value $internalField; }
    top                 { type inletOutlet; inletValue $internalField; value $internalField; }
    bottom              { type zeroGradient; }
    bunkering-boat_m    { type zeroGradient; }
    bunkering-quay_m    { type zeroGradient; }
    nozzle_holder_wall  { type zeroGradient; }
    nozzle              { type fixedValue; value uniform 0; }
}
// ************************************************************************* //
