Bunkering_06/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler; //CrankNicolson 0.9;
}

gradSchemes
{
    default    cellLimited Gauss linear 1.0; // cellMDLimited; Gauss linear;
    grad(U)    cellLimited Gauss linear 1.0;                                                  
}

divSchemes
{
    default         none;

    div(phi,U)        Gauss limitedLinearV 0.5;
    div(phi,Yi_h)     Gauss multivariateSelection //Gauss limitedLinear 1;
    {
        H2   limitedLinear01 0.5; //upwind;   
        O2   limitedLinear01 0.5; //upwind; 
        H2O  limitedLinear01 0.5; //upwind; 
        N2   limitedLinear01 0.5; //upwind;
        h    limitedLinear 0.5; //upwind;
    };
    div(phi,K)        Gauss limitedLinear 0.5;  //upwind; 
    div(phid,p)       Gauss limitedLinear 0.5;  //upwind; 
    div(phi,epsilon)  Gauss limitedLinear 0.5;  //upwind; 
    div(phi,k)        Gauss limitedLinear 0.5;  //upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected; //Gauss linear limited 1.0;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected; //limited 1.0;
}

// ************************************************************************* //
